{"meta":{"title":"Haoxuan's Blog","subtitle":"","description":"","author":"Haoxuan Xie","url":"https://haoxuanxie.github.io/blogs","root":"/blogs/"},"pages":[],"posts":[{"title":"The XOR sum of 4x, 4x + 1, 4x + 2 and 4x + 3 is 0 for any non-negative integer x","slug":"xorsum","date":"2024-09-02T13:19:05.000Z","updated":"2024-09-03T10:51:36.507Z","comments":true,"path":"2024/09/02/xorsum/","permalink":"https://haoxuanxie.github.io/blogs/2024/09/02/xorsum/","excerpt":"","text":"In this article, we would use to represent the bitwise XOR operation between two integers. We observe that: for any , , and therefore, for any . We now illustrate the formal proof of the above observation. We firstly write into a binary format, i.e.: Let . Then: Then the binary formats of are: Since the most significant bits of all aforementioned numbers are the same, the XOR sum of this part should be 0. For the latter bits, i.e., the 2 least significant bits, it is easy to compute that: Therefore, , and the proof is done.","categories":[],"tags":[]},{"title":"Welcome to my blog!","slug":"hello","date":"2024-09-02T13:19:04.000Z","updated":"2024-09-03T10:50:07.477Z","comments":true,"path":"2024/09/02/hello/","permalink":"https://haoxuanxie.github.io/blogs/2024/09/02/hello/","excerpt":"","text":"In my very early ages, I have planned to set up a personal blog. However, all my personal blogs were discarded either because I felt tired to maintain it or I felt nobody was going to read my posts. And as you see, this is my another attempt, and I would try my best to maintain this blog for this time. I know some of you may be my friends or you just come from my homepage. Different from my homepage which highlights my research publications, this blogs would record some personal thoughts, and some interesting ideas that may be too trivial to publish a paper. I may publish posts in multiple fields, including maths, computer science and so on (if I learn something new in the future). The thoughts may be quite random, and I would try to keep the posts brief to avoid them from being messed up. Initially, I want to start my blog page with sharing of personal experiences. But, I don’t know whether everyone would be interested in it. Therefore, the welcome page ends here, and I would fill in more contents via subsequent posts.","categories":[],"tags":[]}],"categories":[],"tags":[]}