{"meta":{"title":"Haoxuan's Blog","subtitle":"","description":"","author":"Haoxuan Xie","url":"https://haoxuanxie.github.io/blogs","root":"/blogs/"},"pages":[],"posts":[{"title":"Maintaining the diameter of a growing tree in $O(\\log n)$ time","slug":"diameter","date":"2024-09-03T10:57:20.000Z","updated":"2024-09-03T11:50:39.566Z","comments":true,"path":"2024/09/03/diameter/","permalink":"https://haoxuanxie.github.io/blogs/2024/09/03/diameter/","excerpt":"","text":"A tree is a connected undirected graph with nodes and edges. The diameter of a tree is the largest distance between two nodes in the tree. We define a growing tree as follows: at each moment, a new node is inserted into the tree, and is connected to some node in the original tree. What is the diameter of the new tree? Let be the path such that the length of is the diameter of the original tree. A key observation is that if are the endpoints of , then for the new tree, the endpoints of the new path for the new diameter must be or . The proof is rather simple. The distance between is actually the length of . By the definition of the tree diameter, it is also the largest distance between two nodes in the original tree. Since the distances between two nodes do not change in the original and new tree, the only candidate nodes to be the new endpoints could only be (for other nodes, since they have the same distances which are not larger than , we could just ignore them). Therefore, to derive the new diamter, we only need to maintain for each moment, and compute the distances between and after each moment, where the largest distance is the new diameter. The distance between could be computed by , where is the depth of the node and is the lowest common ancestor of two nodes, and other distances could be computed similarly. The depth of the new node could be maintained in time for each moment. Maintaining and computing could be done in time for each moment. As a result, we could maintain the diameter of a growing tree in time.","categories":[],"tags":[]},{"title":"The XOR sum of 4x, 4x + 1, 4x + 2 and 4x + 3 is 0 for any non-negative integer x","slug":"xorsum","date":"2024-09-02T13:19:05.000Z","updated":"2024-09-03T10:51:36.507Z","comments":true,"path":"2024/09/02/xorsum/","permalink":"https://haoxuanxie.github.io/blogs/2024/09/02/xorsum/","excerpt":"","text":"In this article, we would use to represent the bitwise XOR operation between two integers. We observe that: for any , , and therefore, for any . We now illustrate the formal proof of the above observation. We firstly write into a binary format, i.e.: Let . Then: Then the binary formats of are: Since the most significant bits of all aforementioned numbers are the same, the XOR sum of this part should be 0. For the latter bits, i.e., the 2 least significant bits, it is easy to compute that: Therefore, , and the proof is done.","categories":[],"tags":[]},{"title":"Welcome to my blog!","slug":"hello","date":"2024-09-02T13:19:04.000Z","updated":"2024-09-03T10:50:07.477Z","comments":true,"path":"2024/09/02/hello/","permalink":"https://haoxuanxie.github.io/blogs/2024/09/02/hello/","excerpt":"","text":"In my very early ages, I have planned to set up a personal blog. However, all my personal blogs were discarded either because I felt tired to maintain it or I felt nobody was going to read my posts. And as you see, this is my another attempt, and I would try my best to maintain this blog for this time. I know some of you may be my friends or you just come from my homepage. Different from my homepage which highlights my research publications, this blogs would record some personal thoughts, and some interesting ideas that may be too trivial to publish a paper. I may publish posts in multiple fields, including maths, computer science and so on (if I learn something new in the future). The thoughts may be quite random, and I would try to keep the posts brief to avoid them from being messed up. Initially, I want to start my blog page with sharing of personal experiences. But, I don’t know whether everyone would be interested in it. Therefore, the welcome page ends here, and I would fill in more contents via subsequent posts.","categories":[],"tags":[]}],"categories":[],"tags":[]}